IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_dev_cfg_regs.xml
<module id="DEV_CFG_REGS" HW_revision="" description="DEV CFG Registers">
	<register id="DEVCFGLOCK1" width="32" page="1" offset="0x0" internal="0" description="Lock bit for CPUSELx registers">
		<bitfield id="CPUSEL0" description="Lock bit for CPUSEL0 register" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CPUSEL1" description="Lock bit for CPUSEL1 register" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CPUSEL2" description="Lock bit for CPUSEL2 register" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CPUSEL3" description="Lock bit for CPUSEL3 register" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CPUSEL4" description="Lock bit for CPUSEL4 register" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CPUSEL5" description="Lock bit for CPUSEL5 register" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CPUSEL6" description="Lock bit for CPUSEL6 register" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CPUSEL7" description="Lock bit for CPUSEL7 register" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CPUSEL8" description="Lock bit for CPUSEL8 register" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CPUSEL9" description="Lock bit for CPUSEL9 register" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CPUSEL11" description="Lock bit for CPUSEL11 register" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="CPUSEL12" description="Lock bit for CPUSEL12 register" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="CPUSEL13" description="Lock bit for CPUSEL13 register" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="CPUSEL14" description="Lock bit for CPUSEL14 register" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="CPUSEL15" description="Lock bit for CPUSEL15 register" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="CPUSEL16" description="Lock bit for CPUSEL16 register" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CPUSEL17" description="Lock bit for CPUSEL17 register" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="CPUSEL23" description="Lock bit for CPUSEL23 register" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="CPUSEL25" description="Lock bit for CPUSEL25 register" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="CPUSEL26" description="Lock bit for CPUSEL26 register" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="CPUSEL27" description="Lock bit for CPUSEL27 register" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="CPUSEL28" description="Lock bit for CPUSEL28 register" begin="28" end="28" width="1" rwaccess="RW"/>
	</register>
	<register id="DEVCFGLOCK2" width="32" page="1" offset="0x2" internal="0" description="Lock bit for DEVCFG registers">
		<bitfield id="BANKMUXSEL" description="Flash Bank Mux Select" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="PARTIDL" width="32" page="1" offset="0x8" internal="0" description="Lower 32-bit of Device PART Identification Number">
		<bitfield id="QUAL" description="Qualification Status" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="PIN_COUNT" description="Device Pin Count" begin="10" end="8" width="3" rwaccess="RW"/>
		<bitfield id="FLASH_SIZE" description="FLASH_SIZE" begin="23" end="16" width="8" rwaccess="RW"/>
	</register>
	<register id="PARTIDH" width="32" page="1" offset="0xa" internal="0" description="Upper 32-bit of Device PART Identification Number">
		<bitfield id="FAMILY" description="Device family" begin="15" end="8" width="8" rwaccess="RW"/>
		<bitfield id="PARTNO" description="Device part number" begin="23" end="16" width="8" rwaccess="RW"/>
		<bitfield id="DEVICE_CLASS_ID" description="Device class ID" begin="31" end="24" width="8" rwaccess="R"/>
	</register>
	<register id="REVID" width="32" page="1" offset="0xc" internal="0" description="Device Revision Number">
		<bitfield id="REVID" description="Device Revision ID. This is specific to the Device" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="BANKMUXSEL" width="32" page="1" offset="0x60" internal="0" description="Flash Bank allocation to CPU. Internal note : This register is accessible (read-only) by CPU2, for devices with CPU2">
		<bitfield id="BANK0" description="Select Flash Bank Controller CPU for Read accesses" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="BANK1" description="Select Flash Bank Controller CPU for Read accesses" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="BANK2" description="Select Flash Bank Controller CPU for Read accesses" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="BANK3" description="Select Flash Bank Controller CPU for Read accesses" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="BANK4" description="Select Flash Bank Controller CPU for Read accesses" begin="9" end="8" width="2" rwaccess="RW"/>
	</register>
	<register id="MCUCNF0" width="32" page="1" offset="0x78" internal="0" description="MCU Configuration register for DC0.DUAL_CORE">
		<bitfield id="DUAL_CORE" description="User Configurable Single Core vs Dual Core" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNF1" width="32" page="1" offset="0x7a" internal="0" description="MCU Configuration register for LockStep Feature on device">
		<bitfield id="MSEL_D2" description="Controller Select for MSEL_D2" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="MSEL_D3" description="Controller Select for MSEL_D3" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="MSEL_D4" description="Controller Select for MSEL_D4" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="MSEL_D5" description="Controller Select for MSEL_D5" begin="5" end="5" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNF2" width="32" page="1" offset="0x7c" internal="0" description="MCU Configuration register for EtherCAT">
		<bitfield id="ETHERCAT" description="ETHERCAT" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
