IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_dev_cfg_regs.xml
	<register id="MCUCNF3" width="32" page="1" offset="0x7e" internal="0" description="MCU Configuration register for Flash Bank 1">
		<bitfield id="SECT15_0" description="Flash sectors 15_0 present" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SECT31_16" description="Flash sectors 31_16 present" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SECT47_32" description="Flash sectors 47_32 present" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SECT63_48" description="Flash sectors 63_48 present" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SECT79_64" description="Flash sectors 79_64 present" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SECT95_80" description="Flash sectors 95_80 present" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SECT111_96" description="Flash sectors 111_96 present" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SECT127_112" description="Flash sectors 127_112 present" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNF4" width="32" page="1" offset="0x80" internal="0" description="MCU Configuration register for Flash Bank 2">
		<bitfield id="SECT15_0" description="Flash sectors 15_0 present" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SECT31_16" description="Flash sectors 31_16 present" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SECT47_32" description="Flash sectors 47_32 present" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SECT63_48" description="Flash sectors 63_48 present" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SECT79_64" description="Flash sectors 79_64 present" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SECT95_80" description="Flash sectors 95_80 present" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SECT111_96" description="Flash sectors 111_96 present" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SECT127_112" description="Flash sectors 127_112 present" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNF5" width="32" page="1" offset="0x82" internal="0" description="MCU Configuration register for Flash Bank 3">
		<bitfield id="SECT15_0" description="Flash sectors 15_0 present" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SECT31_16" description="Flash sectors 31_16 present" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SECT47_32" description="Flash sectors 47_32 present" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SECT63_48" description="Flash sectors 63_48 present" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SECT79_64" description="Flash sectors 79_64 present" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SECT95_80" description="Flash sectors 95_80 present" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SECT111_96" description="Flash sectors 111_96 present" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SECT127_112" description="Flash sectors 127_112 present" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNF6" width="32" page="1" offset="0x84" internal="0" description="MCU Configuration register for Flash Bank 4">
		<bitfield id="SECT15_0" description="Flash sectors 15_0 present" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SECT31_16" description="Flash sectors 31_16 present" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SECT47_32" description="Flash sectors 47_32 present" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SECT63_48" description="Flash sectors 63_48 present" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SECT79_64" description="Flash sectors 79_64 present" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SECT95_80" description="Flash sectors 95_80 present" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SECT111_96" description="Flash sectors 111_96 present" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SECT127_112" description="Flash sectors 127_112 present" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNF7" width="32" page="1" offset="0x86" internal="0" description="MCU Configuration register for Flash Bank 5">
		<bitfield id="SECT15_0" description="Flash sectors 15_0 present" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SECT31_16" description="Flash sectors 31_16 present" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SECT47_32" description="Flash sectors 47_32 present" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SECT63_48" description="Flash sectors 63_48 present" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SECT79_64" description="Flash sectors 79_64 present" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SECT95_80" description="Flash sectors 95_80 present" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SECT111_96" description="Flash sectors 111_96 present" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SECT127_112" description="Flash sectors 127_112 present" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="MCUCNFLOCK" width="32" page="1" offset="0x8c" internal="0" description="Lock bit for MCUCNFx registers">
		<bitfield id="MCUCNF0" description="Lock bit for MCUCNF0 register" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="MCUCNF1" description="Lock bit for MCUCNF1 register" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="MCUCNF2" description="Lock bit for MCUCNF2 register" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="MCUCNF3" description="Lock bit for MCUCNF3 register" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="MCUCNF4" description="Lock bit for MCUCNF4 register" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="MCUCNF5" description="Lock bit for MCUCNF5 register" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="MCUCNF6" description="Lock bit for MCUCNF6 register" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="MCUCNF7" description="Lock bit for MCUCNF7 register" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="TRIMERRSTS" width="32" page="1" offset="0x8e" internal="0" description="TRIM Error Status register">
		<bitfield id="LERR" description="TRIM Load error status" begin="15" end="0" width="16" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES0" width="32" page="1" offset="0x9c" internal="0" description="Processing Block Software Reset register">
		<bitfield id="CPU1_CLA1" description="CPU1_CLA1 software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CPU1_CPUBGCRC" description="CPU1 CPUBGCRC Module reset bit" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="CPU1_CLA1BGCRC" description="CPU1 CLA1BGCRC Module reset bit" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="CPU2_CPUBGCRC" description="CPU2 CPUBGCRC Module reset bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="CPU1_ERAD" description="ERAD Module reset bit" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="CPU2_ERAD" description="ERAD Module reset bit" begin="25" end="25" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES1" width="32" page="1" offset="0x9e" internal="0" description="EMIF Software Reset register">
		<bitfield id="EMIF1" description="EMIF1 software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES2" width="32" page="1" offset="0xa0" internal="0" description="EPWM Software Reset register">
		<bitfield id="EPWM1" description="EPWM1 software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EPWM2" description="EPWM2 software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EPWM3" description="EPWM3 software reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="EPWM4" description="EPWM4 software reset bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="EPWM5" description="EPWM5 software reset bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EPWM6" description="EPWM6 software reset bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="EPWM7" description="EPWM7 software reset bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="EPWM8" description="EPWM8 software reset bit" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="EPWM9" description="EPWM9 software reset bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="EPWM10" description="EPWM10 software reset bit" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="EPWM11" description="EPWM11 software reset bit" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="EPWM12" description="EPWM12 software reset bit" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="EPWM13" description="EPWM13 software reset bit" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="EPWM14" description="EPWM14 software reset bit" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="EPWM15" description="EPWM15 software reset bit" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="EPWM16" description="EPWM16 software reset bit" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="EPWM17" description="EPWM17 software reset bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="EPWM18" description="EPWM18 software reset bit" begin="17" end="17" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES3" width="32" page="1" offset="0xa2" internal="0" description="ECAP Software Reset register">
		<bitfield id="ECAP1" description="ECAP1 software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ECAP2" description="ECAP2 software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ECAP3" description="ECAP3 software reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ECAP4" description="ECAP4 software reset bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="ECAP5" description="ECAP5 software reset bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ECAP6" description="ECAP6 software reset bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ECAP7" description="ECAP7 software reset bit" begin="6" end="6" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES4" width="32" page="1" offset="0xa4" internal="0" description="EQEP Software Reset register">
		<bitfield id="EQEP1" description="EQEP1 software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EQEP2" description="EQEP2 software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EQEP3" description="EQEP3 software reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="EQEP4" description="EQEP4 software reset bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="EQEP5" description="EQEP5 software reset bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EQEP6" description="EQEP6 software reset bit" begin="5" end="5" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES6" width="32" page="1" offset="0xa8" internal="0" description="Sigma Delta Software Reset register">
		<bitfield id="SD1" description="SD1 software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SD2" description="SD2 software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SD3" description="SD3 software reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SD4" description="SD4 software reset bit" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
