IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_dev_cfg_regs.xml
	<register id="SOFTPRES7" width="32" page="1" offset="0xaa" internal="0" description="SCI, UART Software Reset register">
		<bitfield id="SCI_A" description="SCI_A software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SCI_B" description="SCI_B software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="UART_A" description="UART_A software reset bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="UART_B" description="UART_B software reset bit" begin="17" end="17" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES8" width="32" page="1" offset="0xac" internal="0" description="SPI Software Reset register">
		<bitfield id="SPI_A" description="SPI_A software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SPI_B" description="SPI_B software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SPI_C" description="SPI_C software reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SPI_D" description="SPI_D software reset bit" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES9" width="32" page="1" offset="0xae" internal="0" description="I2C Software Reset register">
		<bitfield id="I2C_A" description="I2C_A software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="I2C_B" description="I2C_B software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="PMBUS_A" description="PMBUS_A software reset bit" begin="16" end="16" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES10" width="32" page="1" offset="0xb0" internal="0" description="CAN Software Reset register">
		<bitfield id="CAN_A" description="CAN_A software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="MCAN_A" description="MCAN_A  software reset bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="MCAN_B" description="MCAN_B  software reset bit" begin="5" end="5" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES11" width="32" page="1" offset="0xb2" internal="0" description="McBSP/USB Software Reset register">
		<bitfield id="USB_A" description="USB_A software reset bit" begin="16" end="16" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES13" width="32" page="1" offset="0xb6" internal="0" description="ADC Software Reset register">
		<bitfield id="ADC_A" description="ADC_A software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ADC_B" description="ADC_B software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ADC_C" description="ADC_C software reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES14" width="32" page="1" offset="0xb8" internal="0" description="CMPSS Software Reset register">
		<bitfield id="CMPSS1" description="CMPSS1 software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS2" description="CMPSS2 software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS3" description="CMPSS3 software reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS4" description="CMPSS4 software reset bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS5" description="CMPSS5 software reset bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS6" description="CMPSS6 software reset bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS7" description="CMPSS7 software reset bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS8" description="CMPSS8 software reset bit" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS9" description="CMPSS9 software reset bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS10" description="CMPSS10 software reset bit" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS11" description="CMPSS11 software reset bit" begin="10" end="10" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES16" width="32" page="1" offset="0xbc" internal="0" description="DAC Software Reset register">
		<bitfield id="DAC_A" description="Buffered_DAC_A software reset bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="DAC_C" description="Buffered_DAC_C software reset bit" begin="18" end="18" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES17" width="32" page="1" offset="0xbe" internal="0" description="CLB Software Reset register">
		<bitfield id="CLB1" description="CLB1 software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CLB2" description="CLB2 software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CLB3" description="CLB3 software reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CLB4" description="CLB4 software reset bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CLB5" description="CLB5 software reset bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CLB6" description="CLB6 software reset bit" begin="5" end="5" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES18" width="32" page="1" offset="0xc0" internal="0" description="FSI Software Reset register">
		<bitfield id="FSITX_A" description="FSITX_A software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="FSITX_B" description="FSITX_B software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_A" description="FSIRX_A software reset bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_B" description="FSIRX_B software reset bit" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_C" description="FSIRX_C software reset bit" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_D" description="FSIRX_D software reset bit" begin="19" end="19" width="1" rwaccess="RW"/>
	</register>
