IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_dev_cfg_regs.xml
	<register id="SOFTPRES19" width="32" page="1" offset="0xc2" internal="0" description="LIN Software Reset register">
		<bitfield id="LIN_A" description="LIN_A software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LIN_B" description="LIN_B software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES21" width="32" page="1" offset="0xc6" internal="0" description="DCC Software Reset register">
		<bitfield id="DCC0" description="DCC Module reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DCC1" description="DCC Module reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DCC2" description="DCC Module reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES23" width="32" page="1" offset="0xca" internal="0" description="ETHERCAT Software Reset register">
		<bitfield id="ETHERCAT" description="ETHERCAT Module reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES26" width="32" page="1" offset="0xd0" internal="0" description="AES Software Reset register">
		<bitfield id="AESA" description="AES Module Reset Bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES27" width="32" page="1" offset="0xd2" internal="0" description="EPG Software Reset register">
		<bitfield id="EPG1" description="EPG Module Reset Bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES28" width="32" page="1" offset="0xd4" internal="0" description="Flash Software Reset register">
		<bitfield id="FLASHA" description="Flash Wrapper Module Reset Bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="SOFTPRES29" width="32" page="1" offset="0xd6" internal="0" description="ADCCHECKER Software Reset register">
		<bitfield id="ADCCHECKER1" description="ADCCHECKER1 software reset bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ADCCHECKER2" description="ADCCHECKER2 software reset bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ADCCHECKER3" description="ADCCHECKER3 software reset bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ADCCHECKER4" description="ADCCHECKER4 software reset bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="ADCCHECKER5" description="ADCCHECKER5 software reset bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ADCCHECKER6" description="ADCCHECKER6 software reset bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ADCCHECKER7" description="ADCCHECKER7 software reset bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="ADCCHECKER8" description="ADCCHECKER8 software reset bit" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="ADCSEAGGRCPU1" description="ADCSEAGGRCPU1 software reset bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="ADCSEAGGRCPU2" description="ADCSEAGGRCPU2 software reset bit" begin="17" end="17" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUSEL0" width="32" page="1" offset="0xf0" internal="0" description="CPU Select register for common peripherals">
		<bitfield id="EPWM1" description="EPWM1 CPU select bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EPWM2" description="EPWM2 CPU select bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EPWM3" description="EPWM3 CPU select bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="EPWM4" description="EPWM4 CPU select bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="EPWM5" description="EPWM5 CPU select bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EPWM6" description="EPWM6 CPU select bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="EPWM7" description="EPWM7 CPU select bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="EPWM8" description="EPWM8 CPU select bit" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="EPWM9" description="EPWM9 CPU select bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="EPWM10" description="EPWM10 CPU select bit" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="EPWM11" description="EPWM11 CPU select bit" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="EPWM12" description="EPWM12 CPU select bit" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="EPWM13" description="EPWM13 CPU select bit" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="EPWM14" description="EPWM14 CPU select bit" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="EPWM15" description="EPWM15 CPU select bit" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="EPWM16" description="EPWM16 CPU select bit" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="EPWM17" description="EPWM17 CPU select bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="EPWM18" description="EPWM18 CPU select bit" begin="17" end="17" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUSEL1" width="32" page="1" offset="0xf2" internal="0" description="CPU Select register for common peripherals">
		<bitfield id="ECAP1" description="ECAP1 CPU select bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ECAP2" description="ECAP2 CPU select bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ECAP3" description="ECAP3 CPU select bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ECAP4" description="ECAP4 CPU select bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="ECAP5" description="ECAP5 CPU select bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ECAP6" description="ECAP6 CPU select bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ECAP7" description="ECAP7 CPU select bit" begin="6" end="6" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUSEL2" width="32" page="1" offset="0xf4" internal="0" description="CPU Select register for common peripherals">
		<bitfield id="EQEP1" description="EQEP1 CPU select bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="EQEP2" description="EQEP2 CPU select bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="EQEP3" description="EQEP3 CPU select bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="EQEP4" description="EQEP4 CPU select bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="EQEP5" description="EQEP5 CPU select bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EQEP6" description="EQEP6 CPU select bit" begin="5" end="5" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUSEL3" width="32" page="1" offset="0xf6" internal="0" description="CPU Select register for common peripherals">
		<bitfield id="HRCAP6" description="HRCAP6 CPU select bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="HRCAP7" description="HRCAP7 CPU select bit" begin="6" end="6" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUSEL4" width="32" page="1" offset="0xf8" internal="0" description="CPU Select register for common peripherals">
		<bitfield id="SD1" description="SD1 CPU select bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SD2" description="SD2 CPU select bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SD3" description="SD3 CPU select bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SD4" description="SD4 CPU select bit" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUSEL5" width="32" page="1" offset="0xfa" internal="0" description="CPU Select register for common peripherals">
		<bitfield id="SCI_A" description="SCI_A CPU select bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SCI_B" description="SCI_B CPU select bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="UART_A" description="UART_A CPU select bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="UART_B" description="UART_B CPU select bit" begin="17" end="17" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUSEL6" width="32" page="1" offset="0xfc" internal="0" description="CPU Select register for common peripherals">
		<bitfield id="SPI_A" description="SPI_A CPU select bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SPI_B" description="SPI_B CPU select bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SPI_C" description="SPI_C CPU select bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SPI_D" description="SPI_D CPU select bit" begin="3" end="3" width="1" rwaccess="RW"/>
	</register>
