IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_dev_cfg_regs.xml
	<register id="CPUSEL7" width="32" page="1" offset="0xfe" internal="0" description="CPU Select register for common peripherals">
		<bitfield id="I2C_A" description="I2C_A CPU select bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="I2C_B" description="I2C_B CPU select bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="PMBUS_A" description="PMBUS_A CPU select bit" begin="16" end="16" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUSEL8" width="32" page="1" offset="0x100" internal="0" description="CPU Select register for common peripherals">
		<bitfield id="CAN_A" description="CAN_A CPU select bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="MCAN_A" description="MCAN_A CPU select bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="MCAN_B" description="MCAN_B CPU select bit" begin="5" end="5" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUSEL9" width="32" page="1" offset="0x102" internal="0" description="CPU Select register for common peripherals">
		<bitfield id="USB_A" description="USB_A CPU select bit" begin="16" end="16" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUSEL11" width="32" page="1" offset="0x106" internal="0" description="CPU Select register for common peripherals">
		<bitfield id="ADC_A" description="ADC_A CPU select bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ADC_B" description="ADC_B CPU select bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ADC_C" description="ADC_C CPU select bit" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUSEL12" width="32" page="1" offset="0x108" internal="0" description="CPU Select register for common peripherals">
		<bitfield id="CMPSS1" description="CMPSS1 CPU select bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS2" description="CMPSS2 CPU select bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS3" description="CMPSS3 CPU select bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS4" description="CMPSS4 CPU select bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS5" description="CMPSS5 CPU select bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS6" description="CMPSS6 CPU select bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS7" description="CMPSS7 CPU select bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS8" description="CMPSS8 CPU select bit" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS9" description="CMPSS9 CPU select bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS10" description="CMPSS10 CPU select bit" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CMPSS11" description="CMPSS11 CPU select bit" begin="10" end="10" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUSEL13" width="32" page="1" offset="0x10a" internal="0" description="CPU select register for DCC">
		<bitfield id="DCC0" description="DCC0 CPU select bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DCC1" description="DCC1 CPU select bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DCC2" description="DCC2 CPU select bit" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUSEL14" width="32" page="1" offset="0x10c" internal="0" description="CPU Select register for common peripherals">
		<bitfield id="DAC_A" description="Buffered_DAC_A CPU select bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="DAC_C" description="Buffered_DAC_C CPU select bit" begin="18" end="18" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUSEL15" width="32" page="1" offset="0x10e" internal="0" description="CPU select register for CLB tiles">
		<bitfield id="CLB1" description="CLB1 CPU select bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CLB2" description="CLB2 CPU select bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CLB3" description="CLB3 CPU select bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CLB4" description="CLB4 CPU select bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CLB5" description="CLB5 CPU select bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CLB6" description="CLB6 CPU select bit" begin="5" end="5" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUSEL16" width="32" page="1" offset="0x110" internal="0" description="CPU select register for FSI">
		<bitfield id="FSITX_A" description="FSITX_A CPU select bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="FSITX_B" description="FSITX_B CPU select bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_A" description="FSIRX_A CPU select bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_B" description="FSIRX_B CPU select bit" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_C" description="FSIRX_C CPU select bit" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="FSIRX_D" description="FSIRX_D CPU select bit" begin="19" end="19" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUSEL17" width="32" page="1" offset="0x112" internal="0" description="CPU select register for LIN">
		<bitfield id="LIN_A" description="LIN_A CPU select bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="LIN_B" description="LIN_B CPU select bit" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUSEL23" width="32" page="1" offset="0x11e" internal="0" description="CPU select register for EtherCAT">
		<bitfield id="ETHERCAT" description="0 CPU select bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUSEL25" width="32" page="1" offset="0x122" internal="0" description="CPU select register for HRCAL">
		<bitfield id="HRCAL0" description="HRCAL0 CPU select bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="HRCAL1" description="HRCAL1 CPU select bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="HRCAL2" description="HRCAL2 CPU select bit" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUSEL26" width="32" page="1" offset="0x124" internal="0" description="CPU select register for AES">
		<bitfield id="AESA" description="AESA CPU select bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUSEL27" width="32" page="1" offset="0x126" internal="0" description="CPU select register for EPG">
		<bitfield id="EPG1" description="EPG1 CPU select bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUSEL28" width="32" page="1" offset="0x128" internal="0" description="CPU select register for ADCCHECKER tiles">
		<bitfield id="ADCCHECKER1" description="ADCCHECKER1 CPU select bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ADCCHECKER2" description="ADCCHECKER2 CPU select bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ADCCHECKER3" description="ADCCHECKER3 CPU select bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ADCCHECKER4" description="ADCCHECKER4 CPU select bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="ADCCHECKER5" description="ADCCHECKER5 CPU select bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ADCCHECKER6" description="ADCCHECKER6 CPU select bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ADCCHECKER7" description="ADCCHECKER7 CPU select bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="ADCCHECKER8" description="ADCCHECKER8 CPU select bit" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="CPU2RESCTL" width="32" page="1" offset="0x13c" internal="0" description="CPU2 Reset Control Register">
		<bitfield id="RESET" description="CPU2 Reset Control bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Key Qualifier for writes to this register" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="RSTSTAT" width="16" page="1" offset="0x13e" internal="0" description="Reset Status register for secondary C28x CPUs">
		<bitfield id="CPU2RES" description="CPU2 Reset Status bit" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="CPU2NMIWDRST" description="Indicates whether a CPU2.NMIWD reset was issued to CPU2" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="LPMSTAT" width="16" page="1" offset="0x13f" internal="0" description="LPM Status Register for secondary C28x CPUs">
		<bitfield id="CPU2LPMSTAT" description="CPU2 LPM Status" begin="1" end="0" width="2" rwaccess="R"/>
	</register>
	<register id="TAP_STATUS" width="32" page="1" offset="0x14a" internal="0" description="Status of JTAG State machine and Debugger Connect">
		<bitfield id="TAP_STATE" description="Present TAP State" begin="15" end="0" width="16" rwaccess="R"/>
		<bitfield id="DCON" description="Debugger Connect Indication" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="TAP_CONTROL" width="32" page="1" offset="0x14c" internal="0" description="Disable TAP control">
		<bitfield id="BSCAN_DIS" description="Disable BSCAN TAP control" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Key value to enable write" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="USBTYPE" width="16" page="1" offset="0x1d2" internal="0" description="Configures USB Type for the device">
		<bitfield id="TYPE" description="Configure USB type" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="LOCK" description="Lock bit" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="ECAPTYPE" width="16" page="1" offset="0x1d3" internal="0" description="Configures ECAP Type for the device">
		<bitfield id="TYPE" description="Configure ECAP type" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="LOCK" description="Lock bit for the register" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="SDFMTYPE" width="16" page="1" offset="0x1d4" internal="0" description="Configures SDFM Type for the device">
		<bitfield id="TYPE" description="Configure SDFM type" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="LOCK" description="Lock bit" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="MEMMAPTYPE" width="16" page="1" offset="0x1d6" internal="0" description="Configures Memory Map Type for the device">
		<bitfield id="TYPE" description="Configures system specific features related to memory map." begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="LOCK" description="Lock bit" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
</module>
